tap "azure/kubelogin"
tap "int128/kubelogin"
tap "mongodb/brew"
tap "pulumi/tap"
tap "rust-mcp-stack/tap"
brew "sqlite"
brew "awscli"
brew "cairo"
brew "cmake"
brew "leptonica"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fnm"
brew "git-crypt"
brew "glab"
brew "gnupg"
brew "gopass"
brew "grep"
brew "jq"
brew "kubelogin"
brew "libpq"
brew "llama.cpp"
brew "mongosh"
brew "neovim"
brew "oras"
brew "pandoc"
brew "pkgconf"
brew "pulumi"
brew "ramalama"
brew "ranger"
brew "rsync"
brew "starship"
brew "task"
brew "tesseract-lang"
brew "tig"
brew "uv"
brew "watch"
brew "wget"
brew "yq"
brew "mongodb/brew/mongodb-database-tools"
brew "rust-mcp-stack/tap/mcp-discovery"
cask "blackhole-2ch"
cask "block-goose"
cask "neohtop"
cask "session-manager-plugin"
vscode "apollographql.vscode-apollo"
vscode "bierner.markdown-mermaid"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "genaitools.wca-at-ibm"
vscode "ginfuru.better-nunjucks"
vscode "golang.go"
vscode "ibm.wca-core"
vscode "janisdd.vscode-edit-csv"
vscode "mathematic.vscode-pdf"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "mtxr.sqltools"
vscode "orasik.graphql-to-rest-queries"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-openshift-connector"
vscode "redhat.vscode-redhat-account"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "yzhang.markdown-all-in-one"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
