tap "anomalyco/tap"
tap "azure/kubelogin"
tap "int128/kubelogin"
tap "mongodb/brew"
tap "pulumi/tap"
tap "rust-mcp-stack/tap"
brew "argocd"
brew "awscli"
brew "bash"
brew "bitwarden-cli"
brew "cairo"
brew "cmake"
brew "code-server", restart_service: :changed
brew "coreutils"
brew "direnv"
brew "exiftool"
brew "leptonica"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "gh"
brew "git-crypt"
brew "libgit2"
brew "git-delta"
brew "glab"
brew "gnupg"
brew "gopass"
brew "grep"
brew "jq"
brew "just"
brew "kubelogin"
brew "libpq"
brew "llama.cpp"
brew "mise"
brew "mongosh"
brew "neovim"
brew "nono"
brew "oras"
brew "pandoc"
brew "pkgconf"
brew "poetry"
brew "poppler"
brew "pulumi"
brew "ramalama"
brew "ranger"
brew "rsync"
brew "sccache"
brew "starship"
brew "task"
brew "tesseract-lang"
brew "tig"
brew "tmux"
brew "uv"
brew "watch"
brew "wget"
brew "yq"
brew "z3"
brew "zellij"
brew "anomalyco/tap/opencode", trusted: true
brew "mongodb/brew/mongodb-database-tools"
brew "rust-mcp-stack/tap/mcp-discovery"
cask "blackhole-2ch"
cask "block-goose"
cask "ghostty"
cask "neohtop"
cask "session-manager-plugin"
vscode "anthropic.claude-code"
vscode "apollographql.vscode-apollo"
vscode "bierner.markdown-mermaid"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "ginfuru.better-nunjucks"
vscode "golang.go"
vscode "janisdd.vscode-edit-csv"
vscode "mathematic.vscode-pdf"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "mtxr.sqltools"
vscode "orasik.graphql-to-rest-queries"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-openshift-connector"
vscode "redhat.vscode-redhat-account"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "vue.volar"
vscode "yzhang.markdown-all-in-one"
go "cmd/go"
go "cmd/gofmt"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/vektra/mockery/v2"
go "github.com/swaggo/swag/cmd/swag"
cargo "markless"
uv "mlx-lm"
uv "pre-commit"
uv "pyright"
uv "specify-cli"
npm "corepack"
npm "pnpm"
